data/cfdb/verification/couette_shear/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Viscous time scale H^2/nu = 2 s; t = 10 s = 5 viscous times -> steady.
endTime         10;

deltaT          0.005;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // Velocity profile along the gap (21 stations incl. both walls) at t=10s.
    // QoI bottom_wall_shear_normalized is extracted from the profile slope
    // at the bottom wall: |tau| = nu * du/dy|_0 = nu * U_lid / H exactly
    // for the linear analytical solution. (The wallShearStress functionObject
    // is deliberately NOT used: in ESI v2312 it requires a momentumTransport
    // model in the object registry and aborts on laminar icoFoam runs —
    // verified empirically 2026-08-11, "Unable to find turbulence model in
    // the database".)
    // Velocity profile along the gap (21 stations incl. both walls) at t=10s.
    profileSample
    {
        type            sets;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        setFormat       raw;
        sets
        (
            lineY
            {
                type    uniform;
                axis    y;
                start   (0.005 0     0.0005);
                end     (0.005 0.01  0.0005);
                nPoints 21;
            }
        );
        fields          (U);
    }
}

// ************************************************************************* //
